# FilterStringLess Constructor

---
C#Visual BasicVisual C++
Revit 2024 API
---
FilterStringLess Constructor
FilterStringLess Class See Also
---
Constructs an instance of FilterStringLess.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public FilterStringLess()
```

Visual Basic
---
```text
Public Sub New
```

Visual C++
---
```text
public:
FilterStringLess()
```

# See Also
FilterStringLess Class
Autodesk.Revit.DB Namespace